IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_adc_regs.xml
	<register id="ADCSOC15CTL" width="32" page="1" offset="0x2e" internal="0" description="ADC SOC15 Control Register">
		<bitfield id="ACQPS" description="SOC15 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC15 Channel Select" begin="18" end="15" width="4" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC15 Trigger Source Select" begin="24" end="20" width="5" rwaccess="RW"/>
	</register>
	<register id="ADCEVTSTAT" width="16" page="1" offset="0x30" internal="0" description="ADC Event Status Register">
		<bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Flag" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Flag" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Flag" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Flag" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Flag" begin="14" end="14" width="1" rwaccess="R"/>
	</register>
	<register id="ADCEVTCLR" width="16" page="1" offset="0x32" internal="0" description="ADC Event Clear Register">
		<bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Clear" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Clear" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Clear" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Clear" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Clear" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCEVTSEL" width="16" page="1" offset="0x34" internal="0" description="ADC Event Selection Register">
		<bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Event Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Event Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Event Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Event Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Event Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Event Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Event Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Event Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Event Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Event Enable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Event Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Event Enable" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCEVTINTSEL" width="16" page="1" offset="0x36" internal="0" description="ADC Event Interrupt Selection Register">
		<bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Interrupt Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Interrupt Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Interrupt Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Interrupt Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Interrupt Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Interrupt Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Interrupt Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Interrupt Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Interrupt Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Interrupt Enable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Interrupt Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Interrupt Enable" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
